tests/benchmark/results/wrk2_final/thread/c1200.log
Running 15s test @ http://127.0.0.1:9545/hello
  4 threads and 1200 connections
  Thread calibration: mean lat.: 1.903ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.329ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.029ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 199.117ms, rate sampling interval: 688ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  120000 requests in 15.50s, 11.56MB read
  Socket errors: connect 0, read 0, write 0, timeout 7860
Requests/sec:   7741.44
Transfer/sec:    763.56KB